#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.weu_session_manager: Still reading... [10s elapsed]
data.azurerm_linux_web_app.app_backend_li: Still reading... [10s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [10s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [20s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [30s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [40s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [50s elapsed]
data.azurerm_redis_cache.redis_common: Still reading... [1m0s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_session_manager_internal_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.topic_io_auth.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-topic|io-session-notifications-sub|owner"] must be replaced
-/+ resource "azurerm_role_assignment" "subscriptions" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-topic/subscriptions/io-session-notifications-sub/providers/Microsoft.Authorization/roleAssignments/1b100d53-5125-b6fb-a2cd-bc02693c11c2" -> (known after apply)
      ~ name                                   = "1b100d53-5125-b6fb-a2cd-bc02693c11c2" -> (known after apply)
      ~ principal_id                           = "0bd8a47e-3188-45c9-9c74-23f22fca2497" -> "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/090c5cfd-751d-490a-894a-3ce6f1109419" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.topic_io_auth.module.service_bus.azurerm_role_assignment.topics["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|owner"] must be replaced
-/+ resource "azurerm_role_assignment" "topics" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/providers/Microsoft.Authorization/roleAssignments/769f5933-41a7-55e3-d58e-a9db11d334ba" -> (known after apply)
      ~ name                                   = "769f5933-41a7-55e3-d58e-a9db11d334ba" -> (known after apply)
      ~ principal_id                           = "0bd8a47e-3188-45c9-9c74-23f22fca2497" -> "912c0ba1-90b5-47eb-83f7-bf1e1294cd5c" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/090c5cfd-751d-490a-894a-3ce6f1109419" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
